backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_2, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 48, 48, 3]
      dtype: float32
      name: input_2
      sparse: false
    inbound_nodes: []
    name: input_2
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [7, 7]
      name: conv2d_5
      padding: valid
      strides: &id002 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - input_2
        - 0
        - 0
        - {}
    name: conv2d_5
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_7
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - input_2
        - 0
        - 0
        - {}
    name: conv2d_7
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_5
      padding: valid
      pool_size: &id003 !!python/tuple [2, 2]
      strides: *id003
      trainable: true
    inbound_nodes:
    - - - conv2d_5
        - 0
        - 0
        - {}
    name: max_pooling2d_5
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_7
      padding: valid
      pool_size: &id004 !!python/tuple [2, 2]
      strides: *id004
      trainable: true
    inbound_nodes:
    - - - conv2d_7
        - 0
        - 0
        - {}
    name: max_pooling2d_7
  - class_name: Dropout
    config: {name: dropout_6, noise_shape: null, rate: 0.25, seed: null, trainable: true}
    inbound_nodes:
    - - - max_pooling2d_5
        - 0
        - 0
        - {}
    name: dropout_6
  - class_name: Dropout
    config: {name: dropout_8, noise_shape: null, rate: 0.25, seed: null, trainable: true}
    inbound_nodes:
    - - - max_pooling2d_7
        - 0
        - 0
        - {}
    name: dropout_8
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [5, 5]
      name: conv2d_6
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_6
        - 0
        - 0
        - {}
    name: conv2d_6
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_8
      padding: valid
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - dropout_8
        - 0
        - 0
        - {}
    name: conv2d_8
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_6
      padding: valid
      pool_size: &id005 !!python/tuple [2, 2]
      strides: *id005
      trainable: true
    inbound_nodes:
    - - - conv2d_6
        - 0
        - 0
        - {}
    name: max_pooling2d_6
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_8
      padding: valid
      pool_size: &id006 !!python/tuple [2, 2]
      strides: *id006
      trainable: true
    inbound_nodes:
    - - - conv2d_8
        - 0
        - 0
        - {}
    name: max_pooling2d_8
  - class_name: Dropout
    config: {name: dropout_7, noise_shape: null, rate: 0.25, seed: null, trainable: true}
    inbound_nodes:
    - - - max_pooling2d_6
        - 0
        - 0
        - {}
    name: dropout_7
  - class_name: Dropout
    config: {name: dropout_9, noise_shape: null, rate: 0.25, seed: null, trainable: true}
    inbound_nodes:
    - - - max_pooling2d_8
        - 0
        - 0
        - {}
    name: dropout_9
  - class_name: Flatten
    config: {name: flatten_3, trainable: true}
    inbound_nodes:
    - - - dropout_7
        - 0
        - 0
        - {}
    name: flatten_3
  - class_name: Flatten
    config: {name: flatten_4, trainable: true}
    inbound_nodes:
    - - - dropout_9
        - 0
        - 0
        - {}
    name: flatten_4
  - class_name: Concatenate
    config: {axis: -1, name: concatenate_2, trainable: true}
    inbound_nodes:
    - - - flatten_3
        - 0
        - 0
        - &id007 {}
      - - flatten_4
        - 0
        - 0
        - *id007
    name: concatenate_2
  - class_name: Dense
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_3
      trainable: true
      units: 1024
      use_bias: true
    inbound_nodes:
    - - - concatenate_2
        - 0
        - 0
        - {}
    name: dense_3
  - class_name: Dropout
    config: {name: dropout_10, noise_shape: null, rate: 0.4, seed: null, trainable: true}
    inbound_nodes:
    - - - dense_3
        - 0
        - 0
        - {}
    name: dropout_10
  - class_name: Dense
    config:
      activation: sigmoid
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer: null
      name: dense_4
      trainable: true
      units: 2
      use_bias: true
    inbound_nodes:
    - - - dropout_10
        - 0
        - 0
        - {}
    name: dense_4
  name: model_2
  output_layers:
  - [dense_4, 0, 0]
keras_version: 2.1.3
